tutorials/legacy/combustion/PDRFoam/flamePropagationWithObstacles/constant/PDRProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      PDRProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

PDRDragModel basic;

basicCoeffs
{
    drag     on;
    Csu      0.5;
    Csk      0.05;
}


XiModel transport;

transportCoeffs
{
    XiShapeCoef 1;
}


XiEqModel instability;

instabilityCoeffs
{
    XiEqIn 2.5;

    XiEqModel basicSubGrid;

    basicSubGridCoeffs
    {
        XiEqModel SCOPEBlend;

        SCOPEBlendCoeffs
        {
            XiEqModelL
            {
                XiEqModel       Gulder;

                GulderCoeffs
                {
                    XiEqCoef   0.62;
                    uPrimeCoef      1.0;
                    subGridSchelkin true;
                }
            }

            XiEqModelH
            {
                XiEqModel       SCOPEXiEq;

                SCOPEXiEqCoeffs
                {
                    XiEqCoef   1.6;
                    XiEqExp    0.33333;
                    lCoef      0.336;
                    uPrimeCoef      1.0;
                    subGridSchelkin true;
                }
            }
        }
    }
}


XiGModel instabilityG;

instabilityGCoeffs
{
    lambdaIn        lambdaIn   [0 1 0 0 0 0 0] 0.6;
    GIn             GIn        [0 0 -1 0 0 0 0] 1.917;

    XiGModel basicSubGridG;

    basicSubGridGCoeffs
    {
        k1 0.5;

        XiGModel KTS;

        KTSCoeffs
        {
             GEtaCoef   0.28;
        }
    }
}


// ************************************************************************* //
